def f1(a, b): print(a, b)  # Нормальные аргументы

def f2(a, *b): print(a, b)  # Переменное количество позиционных аргументов

def f3(a, **b): print(a, b)  # Переменное количество ключевых аргументов

def f4(a, *b, **c): print(a, b, c)  # Смешанные режимы

def f5(a, b=2, c=3): print(a, b, c)  # Стандартные значения

def f6(a, b=2, *c): print(a, b, c)  # Стандартные значения и переменное количество позиционных аргументов


print("f1(1, 2)")
f1(1, 2)  # 1 2

print("f1(b=2, a=1)")
f1(b=2, a=1)  # 1 2

print("f2(1, 2, 3)")
f2(1, 2, 3)  # 1 (2, 3)

print("f3(1, x=2, y=3)")
f3(1, x=2, y=3)  # 1 {'x': 2, 'y': 3}

print("f4(1, 2, 3, x=2, y=3)")
f4(1, 2, 3, x=2, y=3)  # 1 (2, 3) {'x': 2, 'y': 3}

print("f5(1)")
f5(1)  # 1 2 3

print("f5(1, 4)")
f5(1, 4)  # 1 4 3

print("f6(1)")
f6(1)  # 1 2 ()

print("f6(1, 3, 4)")
f6(1, 3, 4)  # 1 3 (4,)
